In [34]:
import pandas as pd

In [35]:
df = pd.read_csv(r"D:\csv\credits.csv")

In [36]:
df

,person_id,id,name,character,role
0,3748,tm84618,Robert De Niro,Travis Bickle,ACTOR
1,14658,tm84618,Jodie Foster,Iris Steensma,ACTOR
2,7064,tm84618,Albert Brooks,Tom,ACTOR
3,3739,tm84618,Harvey Keitel,Matthew 'Sport' Higgins,ACTOR
4,48933,tm84618,Cybill Shepherd,Betsy,ACTOR
...,...,...,...,...,...
77796,736339,tm1059008,Adelaida Buscato,María Paz,ACTOR
77797,399499,tm1059008,Luz Stella Luengas,Karen Bayona,ACTOR
77798,373198,tm1059008,Inés Prieto,Fanny,ACTOR
77799,378132,tm1059008,Isabel Gaona,Cacica,ACTOR
77800,1950416,tm1059008,Julian Gaviria,NaN,DIRECTOR

In [37]:
df.head(5)

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [38]:
df.shape

(77801, 5)

In [39]:
df.tail(10)

,person_id,id,name,character,role
77791,164248,tm1059008,Jessica Cediel,Liliana Navarro,ACTOR
77792,1402344,tm1059008,Javier Gardeazábal,"Agustín ""Peluca"" Ortíz",ACTOR
77793,369222,tm1059008,Carla Giraldo,Valery Reinoso,ACTOR
77794,369221,tm1059008,Ana María Sánchez,Lourdes,ACTOR
77795,368473,tm1059008,Aída Morales,Maritza,ACTOR
77796,736339,tm1059008,Adelaida Buscato,María Paz,ACTOR
77797,399499,tm1059008,Luz Stella Luengas,Karen Bayona,ACTOR
77798,373198,tm1059008,Inés Prieto,Fanny,ACTOR
77799,378132,tm1059008,Isabel Gaona,Cacica,ACTOR
77800,1950416,tm1059008,Julian Gaviria,NaN,DIRECTOR

In [40]:
df.value_counts()

person_id  id         name             character                  role
7          tm174683   Tamsin Greig     Additional Voices (voice)  ACTOR    1
           tm239927   Tamsin Greig     Elizabeth Wilmshurst       ACTOR    1
           tm244758   Tamsin Greig     Penelope                   ACTOR    1
8          tm287684   Arsher Ali       Phil                       ACTOR    1
           tm434883   Arsher Ali       Jake                       ACTOR    1
                                                                          ..
2462756    tm1080445  Paul Abell       C.I.A. Agent #1            ACTOR    1
2462758    tm1080445  Grace Russo      Teenage Girl #1            ACTOR    1
2462782    tm1080445  Camille Marquez  Elena                      ACTOR    1
2462800    tm1080445  Irina Aylyarova  Czech Doctor               ACTOR    1
2462818    tm1080445  Jeremy Tichy     Officer Zelezny            ACTOR    1
Name: count, Length: 68029, dtype: int64

In [41]:
Schema_df = pd.read_csv(r"D:\csv\credits.csv")

In [42]:
Schema_df

,person_id,id,name,character,role
0,3748,tm84618,Robert De Niro,Travis Bickle,ACTOR
1,14658,tm84618,Jodie Foster,Iris Steensma,ACTOR
2,7064,tm84618,Albert Brooks,Tom,ACTOR
3,3739,tm84618,Harvey Keitel,Matthew 'Sport' Higgins,ACTOR
4,48933,tm84618,Cybill Shepherd,Betsy,ACTOR
...,...,...,...,...,...
77796,736339,tm1059008,Adelaida Buscato,María Paz,ACTOR
77797,399499,tm1059008,Luz Stella Luengas,Karen Bayona,ACTOR
77798,373198,tm1059008,Inés Prieto,Fanny,ACTOR
77799,378132,tm1059008,Isabel Gaona,Cacica,ACTOR
77800,1950416,tm1059008,Julian Gaviria,NaN,DIRECTOR

In [43]:
pd.set_option('display.max_columns',5)
pd.set_option('display.max_rows',400)

In [44]:
df

,person_id,id,name,character,role
0,3748,tm84618,Robert De Niro,Travis Bickle,ACTOR
1,14658,tm84618,Jodie Foster,Iris Steensma,ACTOR
2,7064,tm84618,Albert Brooks,Tom,ACTOR
3,3739,tm84618,Harvey Keitel,Matthew 'Sport' Higgins,ACTOR
4,48933,tm84618,Cybill Shepherd,Betsy,ACTOR
...,...,...,...,...,...
77796,736339,tm1059008,Adelaida Buscato,María Paz,ACTOR
77797,399499,tm1059008,Luz Stella Luengas,Karen Bayona,ACTOR
77798,373198,tm1059008,Inés Prieto,Fanny,ACTOR
77799,378132,tm1059008,Isabel Gaona,Cacica,ACTOR
77800,1950416,tm1059008,Julian Gaviria,NaN,DIRECTOR

In [45]:
df.columns

Index(['person_id', 'id', 'name', 'character', 'role'], dtype='object')

In [46]:
df.loc[0:5]

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR
5      32267  tm84618      Peter Boyle                   Wizard  ACTOR

In [47]:
df.loc[0:15,'name']

0      Robert De Niro
1        Jodie Foster
2       Albert Brooks
3       Harvey Keitel
4     Cybill Shepherd
5         Peter Boyle
6      Leonard Harris
7      Diahnne Abbott
8         Gino Ardito
9     Martin Scorsese
10      Murray Moston
11      Richard Higgs
12        Bill Minkin
13         Bob Maroff
14        Victor Argo
15        Joe Spinell
Name: name, dtype: object

In [48]:
df.iloc[0]

person_id              3748
id                  tm84618
name         Robert De Niro
character     Travis Bickle
role                  ACTOR
Name: 0, dtype: object

In [49]:
df.iloc[[0,1,2,3,4,5],0]

0     3748
1    14658
2     7064
3     3739
4    48933
5    32267
Name: person_id, dtype: int64